Repository: tarlanpay/tarlan-flutter
Catalog: lib/l10n/app_*.arb
Languages: kk, ru

source: Invalid URL format
kk: URL форматы дұрыс емес
ru: Неверный формат URL

source: Invalid parameter format
kk: Параметр форматы дұрыс емес
ru: Неверный формат параметра

source: Unknown
kk: Белгісіз
ru: Неизвестно

# cardNumberRequired
source: Card number is required
kk: Карта нөмірін енгізу қажет
ru: Необходимо указать номер карты

# invalidCardNumber
source: The card number is invalid
kk: Карта нөмірі дұрыс емес
ru: Номер карты указан неверно

# cardExpiryRequired
source: Please provide card expiry date
kk: Картаның жарамдылық мерзімін енгізу қажет
ru: Укажите срок действия карты

# cvvRequired
source: Please provide CVV
kk: CVV енгізу қажет
ru: Укажите CVV

# cardHolderNameRequired
source: Cardholder name is required
kk: Карта иесінің атын енгізу қажет
ru: Необходимо указать имя держателя карты

# emailRequired
source: Email address is required
kk: Электрондық поштаны енгізу қажет
ru: Необходимо указать электронный адрес

# invalidEmailFormat
source: Invalid email address format
kk: Электрондық поштаның форматы дұрыс емес
ru: Неверный формат электронного адреса

# phoneNumberRequired
source: Phone number is required
kk: Телефон нөмірін енгізу қажет
ru: Необходимо указать номер телефона

# incompletePhoneNumber
source: The phone number is incomplete
kk: Телефон нөмірі толық емес
ru: Номер телефона указан не полностью

source: Error
kk: Қате
ru: Ошибка

source: Back
kk: Артқа
ru: Назад

source: Transaction Link
kk: Транзакция сілтемесі
ru: Ссылка на транзакцию

source: Launch Tarlan SDK
kk: Tarlan SDK іске қосу
ru: Запустить Tarlan SDK

source: Client ID
kk: Клиент ID
ru: ID клиента

source: Generate new client ID
kk: Жаңа клиент ID құру
ru: Создать новый ID клиента

source: Project Reference ID
kk: Жобаның сілтеме ID
ru: Референс ID проекта

source: Generate new reference ID
kk: Жаңа сілтеме ID құру
ru: Создать новый референс ID

source: Available actions:
kk: Қолжетімді әрекеттер:
ru: Доступные действия:

source: Pay In
kk: Кіріс төлемі
ru: Входящий платеж

source: Pay Out
kk: Шығыс төлемі
ru: Исходящий платеж

source: Card Link
kk: Картаны байланыстыру
ru: Привязать карту

source: Current environment:
kk: Қазіргі орта:
ru: Текущая среда:

source: Switch Environment
kk: Ортаны ауыстыру
ru: Сменить среду

# currentLocale
source: Current language:
kk: Қазіргі тіл:
ru: Текущий язык:

# switchLocale
source: Switch language
kk: Тілді өзгерту
ru: Сменить язык

# returnToStoreInSeconds
source: Return to the store page in: {remainingTime} sec
kk: Басты бетке {remainingTime} секундтан кейін қайту
ru: Возврат на страницу магазина через: {remainingTime} сек

# saveReceipt
source: Download
kk: Чекті сақтау
ru: Сохранить квитанцию

# orderNumber
source: Order â„–
kk: Тапсырыс нөмірі
ru: Номер заказа

# paymentAmount
source: Amount
kk: Төлем сомасы
ru: Сумма оплаты

# fee
source: Commission
kk: Комиссия
ru: Комиссия

source: Transaction date
kk: Транзакция күні
ru: Дата транзакции

# acquirerBank
source: Bank-acquirer
kk: Эквайер банк
ru: Банк-эквайер

source: Loading receipt...
kk: Чекті жүктеу...
ru: Загрузка квитанции...

source: Error loading receipt
kk: Чекті жүктеу кезінде қате
ru: Ошибка загрузки квитанции

source: Receipt
kk: Чек
ru: Квитанция

source: Remember card
kk: Картаны сақтау
ru: Запомнить карту

# linkCard
source: LINK A CARD
kk: КАРТАНЫ БАЙЛАНЫСТЫРУ
ru: ПРИВЯЗАТЬ КАРТУ

source: PAY
kk: ТӨЛЕУ
ru: ОПЛАТИТЬ

source: Cancel
kk: Бас тарту
ru: Отменить

source: Transaction failed
kk: Транзакция сәтсіз аяқталды
ru: Транзакция прошла неуспешно

# unknownErrorOccurred
source: An unknown error occurred.
kk: Белгісіз қате
ru: Произошла неизвестная ошибка.

source: Loading
kk: Жүктелуде
ru: Загрузка

# cardDoesNotExist
source: This card does not exist
kk: Мұндай карта табылмады
ru: Такой карты не существует

source: Card Number
kk: Карта нөмірі:
ru: Номер карты:

source: Saved Cards
kk: Сақталған карталар
ru: Сохраненные карты

source: + Add new card
kk: + Жаңа карта қосу
ru: + Добавить новую карту

# cardHolderName
source: Name on card
kk: Картадағы есім
ru: Имя на карте

source: Invalid CVV
kk: CVV дұрыс емес
ru: Неверный CVV

source: Card Expiry:
kk: Картаның жарамдылық мерзімі:
ru: Срок действия карты:

source: Invalid card expiry
kk: Картаның жарамдылық мерзімі дұрыс емес
ru: Неверный срок действия карты

source: Phone number
kk: Телефон нөмірі:
ru: Номер телефона:

source: Merchant
kk: Мерчант
ru: Мерчант

source: Type
kk: Тип
ru: Тип

# statusSuccessTitle
source: Card successfully linked.
kk: Карта сәтті байланыстырылды.
ru: Карта успешно привязана.

# statusSuccessMessage
source: Your card is saved and will be available for reuse during payment.
kk: Сіздің картаңыз сақталып, келесі төлемдерде қайта пайдалануға қолжетімді болады.
ru: Ваша карта сохранена и будет доступна для повторного использования при оплате.

# statusErrorTitle
source: Oops! Something went wrong
kk: Oops! Бірдеңе дұрыс болмады.
ru: Oops! Что-то пошло не так

# statusProcessedCardLinkTitle
source: Card linking is being processed.
kk: Картаны байланыстыру өңделіп жатыр.
ru: Привязка карты в обработке

# statusProcessedCardLinkMessage
source: The process of linking your card is currently in progress.
kk: Сіздің картаңызды байланыстыру процесі қазіргі уақытта өңделуде.
ru: Операция по привязке Вашей карты находится в обработке

# statusProcessedPayInTitle
source: Payment acceptance is being processed.
kk: Төлем қабылдау өңделуде.
ru: Прием платежа в обработке.

# statusProcessedPayInMessage
source: The payment acceptance operation is in progress.
kk: Төлемді қабылдау операциясы өңделу үстінде.
ru: Операция по приему платежа находится в процессе обработки.

# statusProcessedPayOutTitle
source: Withdrawal to the card is being processed.
kk: Картаға қаражат шығару өңделуде.
ru: Вывод средств на карту в обработке.

# statusProcessedPayOutMessage
source: The withdrawal operation to the card is currently in progress.
kk: Картаға қаражат шығару операциясы өңделу үстінде.
ru: Операция по выводу средств на карту находится в процессе обработки.

# statusFailedTitle
source: An error occurred.
kk: Қате орын алды.
ru: Транзакция прошла неуспешно.

# statusFailedMessage
source: An error occurred during the transaction, contact the bank for details.
kk: Транзакция кезінде қате орын алды, мәліметтер алу үшін банкке хабарласыңыз.
ru: При проведении произошла ошибка, обратитесь в банк за подробностями.

# statusAuthorizedTitle
source: Payment in progress
kk: Төлем аяқталуда
ru: Платеж в обработке.

# statusAuthorizedMessage
source: Payment in progress. Amount is on hold.
kk: Төлем аяқталуда
ru: Платеж в обработке. Сумма заморожена.

# statusRefundWaitingTitle
source: Card successfully linked.
kk: Карта сәтті қосылды.
ru: Карта успешно привязана.

# statusRefundWaitingMessage
source: Your card has been saved and will be available for reuse during future payments.
kk: Сіздің картаңыз сақталды және болашақ төлемдер кезінде қайта пайдалануға қолжетімді болады.
ru: Ваша карта сохранена и будет доступна для повторного использование при оплате.

# statusRefundTitle
source: Card successfully linked.
kk: Карта сәтті қосылды.
ru: Карта успешно привязана.

# statusRefundMessage
source: Your card has been saved and will be available for reuse during future payments.
kk: Сіздің картаңыз сақталды және болашақ төлемдер кезінде қайта пайдалануға қолжетімді болады.
ru: Ваша карта сохранена и будет доступна для повторного использование при оплате.

# statusCancelledTitle
source: An error occurred.
kk: Қате орын алды.
ru: Произошла ошибка.

# statusCancelledMessage
source: An error occurred during the transaction, contact the bank for details.
kk: Транзакция кезінде қате орын алды, мәліметтер алу үшін банкке хабарласыңыз.
ru: При проведении произошла ошибка, обратитесь в банк за подробностями.

# statusTransactionId
source: Transaction ID:
kk: Транзакция идентификаторы:
ru: ID Транзакции:
